# RemoveDistributionSysType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..RemoveDistributionSysType Method
ElectricalSetting Class See Also
---
Remove an existing distribution system type from the project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveDistributionSysType(
	DistributionSysType distributionSysType
)
```

Visual Basic
---
```text
Public Sub RemoveDistributionSysType ( _
	distributionSysType As DistributionSysType _
)
```

Visual C++
---
```text
public:
void RemoveDistributionSysType(
	DistributionSysType^ distributionSysType
)
```

# ### Parameters
distributionSysType
    Type: Autodesk.Revit.DB.Electrical..::..DistributionSysType
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Distribution system type can be removed only if it is not currently assigned to any devices, otherwise an exception will be thrown. |

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace